# MySQL

Connect to MySQL using the created credentials. The host is defined as $localhost$ and the user as $user$ and password as $password$

In [ ]:
import mysql.connector

print(mysql.connector.__version__)

mydb=mysql.connector.connect(
    host='localhost',
    user='user',
    password='password'
)

print(mydb)

cursor=mydb.cursor()

cursor.execute("CREATE DATABASE test")

Below is to check what dabases are available in MySQL

In [9]:
import mysql.connector

mydb=mysql.connector.connect(
    host='localhost',
    user='user',
    password='password'
)
cursor=mydb.cursor()
cursor.execute("SHOW DATABASES")

for i in cursor:
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)
('test',)

### Create Tables

In [10]:
mydb=mysql.connector.connect(
    host='localhost',
    user='user',
    password='password',
    database='test'
)

print(mydb)

cursor=mydb.cursor()

cursor.execute("CREATE TABLE members (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(20), address VARCHAR(30))")
cursor.execute("CREATE TABLE companies (id INT AUTO_INCREMENT PRIMARY KEY, company_name VARCHAR(30), name VARCHAR(20), position VARCHAR(30), salary VARCHAR(30) )")

cursor.execute("SHOW TABLES")

for x in cursor:
    print(x)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f8d431fb0a0>
('companies',)
('members',)

#### Drop Tables

In [ ]:
mydb=mysql.connector.connect(
    host='localhost',
    user='user',
    password='password',
    database='test'
)


cursor=mydb.cursor()

cursor.execute("DROP TABLE members")
cursor.execute("DROP TABLE companies")

### Insert members' info and their assciated companies

In [11]:
def insert_members_info(db_name, name, address):
    
    mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database=db_name
                                )
    cursor=mydb.cursor()
    
    sql="INSERT INTO members (name, address) VALUES (%s, %s)"
    vals=(name, address)
    cursor.execute(sql, vals)
    
    mydb.commit()
    
    print(cursor.rowcount, "The records are inserted, with this id", cursor.lastrowid)
    
    
def insert_company_info(db_name, company_name, name, position, salary):
    
    mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database=db_name
                                )
    cursor=mydb.cursor()
    
    sql="INSERT INTO companies (company_name, name, position, salary) VALUES (%s, %s, %s, %s)"
    vals=(company_name, name, position, salary)
    cursor.execute(sql, vals)
    
    mydb.commit()
    
    print(cursor.rowcount, "The records are inserted, with this id", cursor.lastrowid)

In [12]:
import pandas as pd

member_dic = {'name':['John', 'Jack', 'Sarah', 'Ben', 'Jennifer', 'Ben'], 'address':['Ohio', 'CA', 'MI', 'WA', 'WI', 'MN']}
df_members_info=pd.DataFrame(member_dic)
df_members_info

       name address
0      John    Ohio
1      Jack      CA
2     Sarah      MI
3       Ben      WA
4  Jennifer      WI
5       Ben      MN

In [13]:
company_dic = {
            'company_name':['FBA', 'MSFTA', 'TSx', 'MSFTA', 'GOOGA', 'AMZ'],
            'name':['John', 'Jack', 'Sarah', 'Ben', 'Jennifer', 'Ben'],
            'position':['Operator', 'Software Engineer', 'Technician', 'Software Engineer', 'Data Scientist', 'IT technician'],
            'salary':['120000', '180000', '200000', '100000', '300000', '120000']
              }
df_company_info = pd.DataFrame(company_dic)
df_company_info

  company_name      name           position  salary
0          FBA      John           Operator  120000
1        MSFTA      Jack  Software Engineer  180000
2          TSx     Sarah         Technician  200000
3        MSFTA       Ben  Software Engineer  100000
4        GOOGA  Jennifer     Data Scientist  300000
5          AMZ       Ben      IT technician  120000

In [14]:
for idx in df_members_info.index:
    
    name=df_members_info.loc[idx, 'name']
    address=df_members_info.loc[idx, 'address']
    
    print('inserting this member: ', name, address)
    
    db_name = 'test'
    insert_members_info(db_name, name, address)
    
for idx in df_company_info.index:
    company_name = df_company_info.loc[idx, 'company_name']
    name = df_company_info.loc[idx, 'name']
    position = df_company_info.loc[idx, 'position']
    salary = df_company_info.loc[idx, 'salary']
    print(f'insert this information: {company_name}, {name}, {position}, {salary}')
    db_name='test'
    insert_company_info(db_name, company_name, name, position, int(salary))

inserting this member:  John Ohio
1 The records are inserted, with this id 1
inserting this member:  Jack CA
1 The records are inserted, with this id 2
inserting this member:  Sarah MI
1 The records are inserted, with this id 3
inserting this member:  Ben WA
1 The records are inserted, with this id 4
inserting this member:  Jennifer WI
1 The records are inserted, with this id 5
inserting this member:  Ben MN
1 The records are inserted, with this id 6
insert this information: FBA, John, Operator, 120000
1 The records are inserted, with this id 1
insert this information: MSFTA, Jack, Software Engineer, 180000
1 The records are inserted, with this id 2
insert this information: TSx, Sarah, Technician, 200000
1 The records are inserted, with this id 3
insert this information: MSFTA, Ben, Software Engineer, 100000
1 The records are inserted, with this id 4
insert this information: GOOGA, Jennifer, Data Scientist, 300000
1 The records are inserted, with this id 5
insert this information: AMZ, Ben, IT technician, 120000
1 The records are inserted, with this id 6

### Fetching information from desired table

In [15]:
def fetch_member_tabel(db_name):
    
    mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database=db_name
                                )
    cursor=mydb.cursor()
    
    try:
        cursor.execute("SELECT * FROM members order by name")
        result = cursor.fetchall()
        [print(i) for i in result]
    except:
        print('The members table does not exist in: ', db_name, ' database')

In [16]:
fetch_member_tabel('test')

(4, 'Ben', 'WA')
(6, 'Ben', 'MN')
(2, 'Jack', 'CA')
(5, 'Jennifer', 'WI')
(1, 'John', 'Ohio')
(3, 'Sarah', 'MI')

### Search in desired tables with a given information

In [17]:
mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database='test'
                                )
cursor=mydb.cursor()

sql = "SELECT * FROM members WHERE address like '%A'"
cursor.execute(sql)
results=cursor.fetchall()

print('members with addresses end with A')
for i in results:
    print(i)

members with addresses end with A
(2, 'Jack', 'CA')
(4, 'Ben', 'WA')

### Delete records in a desired table

In [ ]:
def delete_member_info(db_name, member_name, member_address):
    
    mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database=db_name
                                )
    cursor=mydb.cursor()
    
    print(f'deleting the member: {member_name} with this address: {member_address}')
    
    try:
        sql1 = "SELECT id FROM members where name=%s and address=%s"
        cursor.execute(sql1, (member_name, member_address))
        result = cursor.fetchall()
        print(f"{result} id record deleted")
        
        sql2=f"DELETE from members where name=%s and address=%s"
        cursor.execute(sql2, (member_name, member_address))
        mydb.commit()
    
    except:
        print(f'The name: {member_name} and address:{member_address} do not exist in members table')

In [ ]:
delete_member_info('test', 'Ben', 'WA')

In [ ]:
insert_members_info('test','Ben', 'WA')

### Update members' information

In [ ]:
def update_member_info(db_name, name, old_address, new_address):
    
    mydb=mysql.connector.connect(
                                host='localhost',
                                user='user',
                                password='password',
                                database=db_name
                                )
    cursor=mydb.cursor()
    
    sql="update members set address=%s where address=%s and name=%s"
    vals=(new_address, old_address, name)
    cursor.execute(sql, vals)
    
    mydb.commit()
    print(f'member:{name} address is changed from {old_address} to {new_address}\n')
    print(cursor.rowcount, "The records are inserted, with this id", cursor.lastrowid)

In [ ]:
update_member_info('test','Ben', 'WA', 'CA')

### Inner join two tables

In [21]:
def join_members_companies_tables(db_name):
    
    mydb=mysql.connector.connect(
        host='localhost',
        user='user',
        password='password',
        database=db_name
        )

    cursor=mydb.cursor()
    
    sql="select mem.name as name, mem.address as home_address, comp.company_name as company_name, comp.position as member_position, comp.salary as member_salary\
        from members as mem\
        inner join companies as comp\
        on mem.name=comp.name"
    
    cursor.execute(sql)
    results=cursor.fetchall()
    #mydb.commit()
    df=pd.DataFrame(results, columns=['name', 'state', 'company_name', 'job', 'salary'])
    return df

In [22]:
join_members_companies_tables('test')

       name state company_name                job  salary
0      John  Ohio          FBA           Operator  120000
1      Jack    CA        MSFTA  Software Engineer  180000
2     Sarah    MI          TSx         Technician  200000
3       Ben    MN        MSFTA  Software Engineer  100000
4       Ben    WA        MSFTA  Software Engineer  100000
5  Jennifer    WI        GOOGA     Data Scientist  300000
6       Ben    MN          AMZ      IT technician  120000
7       Ben    WA          AMZ      IT technician  120000